"CIAdditionCompositing" = "Legger til fargekomponenter for å gi en lysforsterkende effekt. Dette filteret brukes ofte for å gjøre områder lysere eller legge til linserefleks.";"CIAffineClamp" = "Utfører en tiltrekningstransformasjon på et kildebilde og klemmer deretter bildepunktene på kanten av det transformerte bildet og utvider dem utover. Dette filteret gir en effekt som ligner på CIAffineTransform-filteret, bortsett fra at det gir et bilde med ubegrenset utstrekning. Du kan bruke dette filteret hvis du vil gjøre et bilde uskarpt, men du vil unngå en myk, svart kant ytterst.";"CIAffineTile" = "Legger til en tiltrekningstransformasjon på et bilde og deler deretter det transformerte bildet inn i brikker.";"CIAffineTransform" = "Legger til en tiltrekningstransformasjon på et bilde. Du kan skalere, forskyve og rotere inndatabildet. Du kan også legge til en kombinasjon av disse handlingene.";"CIBarsSwipeTransition" = "Lager en overgang fra et bilde til et annet ved å fjerne rektangulære deler av forgrunnsbildet for å vise målbildet.";"CIBlendWithMask" = "Bruker verdier fra en gråskalamaske for å interpolere mellom et bilde og bakgrunnen. Når en maskeverdi er 0,0, er resultatet bakgrunnen. Når maskeverdien er 1,0, er resultatet bildet.";"CIBloom" = "Gjør kantene mykere og gir bildet en behagelig glød.";"CIBoxBlur" = "Jevner bildet ut eller gjør det skarpere ved hjelp av en ruteformet konvolveringskjerne.";"CIBumpDistortion" = "Lager en konkav eller konveks krumming fra et bestemt punkt i bildet.";"CIBumpDistortionLinear" = "Lager en krumming med utgangspunkt i en lineær del av bildet.";"CICMYKHalftone" = "Oppretter en versjon av kildebildet med farger og halvtoner ved hjelp av cyan, magenta, gult og svart blekk på en hvit side.";"CICheckerboardGenerator" = "Oppretter et sjakkbrettmønster. Du kan angi størrelse og farge for sjakkbrettet og skarphet på mønsteret.";"CICircleSplashDistortion" = "Forvrenger bildepunktene. Begynner fra omkretsen til en sirkel og går utover.";"CICircularScreen" = "Simulerer et sirkelformet halvtoneraster.";"CICircularWrap" = "Pakker et bilde rundt en gjennomsiktig sirkel. Forvrengningen av bildet øker avhengig av avstanden fra sirkelens sentrum.";"CIColorControls" = "Justerer verdier for metning, lysstyrke og kontrast.";"CIColorCube" = "Bruker en tredimensjonal fargetabell for å transformere bildepunktene i kildebildet. Fargetabellen må være sammensatt av flyttalls-RGBA-ruter som bruker forhåndsmultiplisert alfa. Rutene er organisert i en standardrekkefølge. Kolonnene og radene til dataene er indeksert med henholdsvis rødt og grønt. Hvert dataplan etterfølges av neste, høyere plan i dataene. Planene er indeksert med blått.";"CIColorInvert" = "Inverterer fargene i et bilde.";"CIColorMap" = "Utfører en ikke-lineær transformasjon av kildefargeverdier ved hjelp av tilordningsverdier fra en tabell.";"CIColorMatrix" = "Multipliserer kildefargeverdier og legger til en biasfaktor for hver fargekomponent.";"CIColorMonochrome" = "Tilordner farger på nytt slik at de faller innenfor nyanser av samme farge.";"CIColorPosterize" = "Tilordner røde, grønne og blå fargekomponenter på nytt til antallet lysstyrkeverdier du angir for hver fargekomponent. Dette filteret gjør fargene flatere og gir et resultat som ligner på silketrykk.";"CIComicEffect" = "Simulerer tegneserietegninger ved å lage omriss rundt kantene og legge til en fargehalvtoneeffekt.";"CIConstantColorGenerator" = "Genererer en dekkfarge. Du bruker vanligvis utdata fra dette filteret som inndata i et annet filter.";"CICopyMachineTransition" = "Lager en overgang fra et bilde til et annet ved å simulere effekten av en kopimaskin.";"CICrop" = "Beskjærer et bilde. Størrelsen og formen på det beskjærte bildet er avhengig av firkanten du angir.";"CICrystallize" = "Oppretter polygonformede fargeblokker ved å samle bildepunktfargeverdier for kilde.";"CIDiscBlur" = "Jevner bildet ut eller gjør det skarpere ved hjelp av en skiveformet konvolveringskjerne.";"CIDisintegrateWithMaskTransition" = "Lager en overgang fra et bilde til et annet ved hjelp av formen som er definert av en maske.";"CIDisplacementDistortion" = "Bruker gråskalaverdiene til bilde nummer to på bilde nummer én. Det resulterende bildet har en tekstur som er definert av gråskalaverdiene.";"CIDissolveTransition" = "Lager en overgang fra et bilde til et annet ved hjelp av toning.";"CIDotScreen" = "Simulerer punktmønstrene i et halvtoneraster.";"CIEdges" = "Finner alle kanter i et bilde og viser dem i farger.";"CIEdgeWork" = "Produserer en stilisert svart-hvitt-versjon av et bilde. Effekten ligner på tresnitt.";"CIEightfoldReflectedTile" = "Lager et brikkemønster av et kildebilde ved å bruke 8-veis reflektert symmetri.";"CIExposureAdjust" = "Justerer eksponeringsinnstillingen for et bilde. Fungerer på samme måte som når du styrer eksponeringen for et kamera ved å justere blenderåpningen.";"CIFalseColor" = "Tilordner de to fargene i fargespekteret basert på lystettheten. Falske farger brukes ofte for å behandle astronomisk data og annen vitenskapelig data, for eksempel ultrafiolette bilder og røntgenbilder.";"CIFastBoxBlur" = "Jevner bildet ut eller gjør det skarpere ved hjelp av en ruteformet konvolveringskjerne.";"CIFastDiscBlur" = "Jevner bildet ut eller gjør det skarpere ved hjelp av en skiveformet konvolveringskjerne.";"CIFlashTransition" = "Lager en overgang fra et bilde til et annet ved hjelp av et lysglimt. Lysglimtet kommer fra et punkt du angir. Det begynner som et lite glimt og vokser deretter raskt til hele bildet fylles med fargen til lysglimtet. Når fargen tones ut, vises målbildet.";"CIFourfoldReflectedTile" = "Lager et brikkemønster av et kildebilde ved å bruke 4-veis reflektert symmetri.";"CIFourfoldRotatedTile" = "Lager et brikkemønster av et kildebilde ved å rotere kildebildet i trinn på 90 grader.";"CIFourfoldTranslatedTile" = "Lager et brikkemønster av et kildebilde ved å bruke 4 forskyvingshandlinger.";"CIGammaAdjust" = "Justerer lysstyrken for midttoner. Dette filteret brukes ofte for å kompensere for den ikke-lineære effekten til skjermer. Når du justerer gammainnstillingene, endrer du stigningsgraden for overgangen mellom svart og hvitt.";"CIGaussianBlur" = "Sprer bildepunktene i kilden med en mengde som er spesifisert av en gaussisk fordeling.";"CIGaussianGradient" = "Oppretter en forløpning som skifter fra en farge til en annen ved hjelp av en gaussisk fordeling.";"CIGlassDistortion" = "Forvrenger et bilde ved å legge til en glasslignende tekstur. De uthevede delene i bildet er et resultat av teksturbruk.";"CIGlassLozenge" = "Oppretter en pastillformet linse og forvrenger delen av bildet linsen plasseres over.";"CIGlideReflectedTile" = "Lager et brikkemønster av et kildebilde ved å forskyve bildet og smøre det utover.";"CIGloom" = "Gjør lyse områder av bildet mattere.";"CIHatchedScreen" = "Simulerer skraveringsmønsteret i et halvtoneraster.";"CIHeightFieldFromMask" = "Oppretter et sammenhengende og tredimensjonalt høydefelt fra en gråskalamaske. De hvite verdiene til masken definerer hvilke bildepunkter som er innenfor høydefeltet, mens de svarte verdiene definerer hvilke bildepunkter som er utenfor. Feltet varierer jevnt og kontinuerlig i masken og når verdien 0 ved kanten av masken. Du kan bruke dette filteret sammen med CIShadedMaterial-filteret for å få objekter med ekstremt realistisk skyggelegging.";"CIHexagonalPixellate" = "Viser et bilde som fargede sekskanter. Fargen på sekskantene er gjennomsnittet av bildepunktene de erstatter.";"CIHoleDistortion" = "Oppretter et sirkelformet område som skyver bildepunktene i bildet utover. Bildepunktene som ligger nærmest sirkelen, blir mest forvrengt.";"CIHueAdjust" = "Endrer den generelle nyansen eller fargetonen til bildepunktene i kilden.";"CIKaleidoscope" = "Lager et kaleidoskopbilde av et kildebilde ved å bruke 12-veis symmetri.";"CILanczosScaleTransform" = "Tar utgangspunkt i et kildebilde og lager en skalert versjon med høy kvalitet. Dette filteret brukes ofte for å skalere bilder ned.";"CILenticularHaloGenerator" = "Simulerer en halo som genereres av diffraksjon som oppstår ved spredning på en linse. Dette filteret brukes ofte på et annet bilde for å simulere linserefleks og lignende effekter.";"CILineOverlay" = "Lager en skisse med svarte omriss rundt kantene i bildet. Deler av bildet som ikke har omriss, er gjennomsiktig. Resultatet har alfa og tegnes med svart, så det vil ikke ligne på verken det ene eller det andre til du legger det over et annet bilde ved hjelp av sammensetting med kilden øverst.";"CILineScreen" = "Simulerer linjemønsteret i et halvtoneraster.";"CILinearGradient" = "Oppretter en forløpning som skifter langs en lineær akse mellom to definerte sluttpunkter.";"CIMaskToAlpha" = "Konverterer et gråtonebilde til et hvitt bilde som er maskert med alfa. De hvite verdiene fra kildebildet lager innsiden av masken. De svarte verdiene blir helt gjennomsiktige.";"CIMaximumCompositing" = "Beregner maksimalverdien, etter fargekomponent, for to bilder og lager et bilde ved hjelp av maksimalverdiene. Effekten ligner på kontrastutjevning.";"CIMedianFilter" = "Beregner medianverdien for en gruppe tilstøtende bildepunkter og erstatter alle bildepunktverdier med medianen. Effekten reduserer støy.";"CIMinimumCompositing" = "Beregner den minste verdien, etter fargekomponent, for to bilder og lager et bilde ved hjelp av de minste verdiene. Effekten ligner på overeksponering.";"CIModTransition" = "Lager en overgang fra et bilde til et annet ved å vise målbildet gjennom hull med uregelmessige former.";"CIMotionBlur" = "Gjør et bilde uskarpt for å simulere effekten av å bruke et kamera som beveger seg en bestemt avstand i en bestemt retning mens bildet tas.";"CIMultiplyCompositing" = "Multipliserer fargekomponenten til to bilder og lager et bilde ved hjelp av de multipliserte verdiene. Dette filteret brukes ofte for å legge til en lyskastereffekt eller en lignende lyseffekt i et bilde.";"CINoiseReduction" = "Reduserer støy ved hjelp av en grenseverdi som definerer hva som regnes som støy. Små endringer i lystetthet under grenseverdien regnes som støy, og behandles med støyreduksjon i form av lokal uskarphet. Endringer over grenseverdien regnes som kanter, og gjøres skarpere.";"CIOpTile" = "Segmenterer et bilde, legger til skalering og rotering hvis det er spesifisert, og setter deretter bildet sammen igjen. Resultatet er en popkunst-effekt.";"CIPageCurlTransition" = "Lager en overgang fra et bilde til et annet ved å simulere en side som blas om for å vise det nye bildet.";"CIParallelogramTile" = "Reflekterer et bilde i et parallellogram og lager deretter brikker av resultatet.";"CIPerspectiveTile" = "Legger til en perspektivtransformasjon på et bilde og deler deretter resultatet inn i brikker.";"CIPerspectiveTransform" = "Endrer geometrien til et bilde for å simulere at synsvinkelen til observatøren endres. Du kan bruke perspektivfilteret for å vri på et bilde.";"CIPinchDistortion" = "Oppretter et rektangelformet område som kniper inn bildepunktene i kilden. Bildepunktene som ligger nærmest rektangelet, blir mest forvrengt.";"CIPixellate" = "Gjør et bilde kantete.";"CIPointillize" = "Rendrer kildebildet i pointillistisk stil.";"CIRadialGradient" = "Oppretter en forløpning som skifter radialt mellom to sirkler som har samme sentrum. En av de to sirklene kan ha en radius på 0.";"CIRandomGenerator" = "Oppretter et bilde med ubegrenset utstrekning og bildepunktverdier som består av fire uavhengige og jevnt fordelte tilfeldige tall i området fra 0 til 1.";"CIRippleTransition" = "Lager en overgang fra et bilde til et annet ved hjelp av en rund bølge som utvider seg fra sentrum. Det nye bildet vises når bølgen passerer.";"CISepiaTone" = "Konverterer fargene i et bilde til forskjellige nyanser av brunt.";"CIShadedMaterial" = "Lager et skyggelagt bilde fra et høydefelt. Høydefeltet er definert for å ha høyere områder med lyse toner og lavere områder med mørke toner. Du kan kombinere dette filteret med CIHeightFieldFromMask-filteret for å skyggelegge masker, for eksempel tekst, på en rask måte.";"CISharpenLuminance" = "Øker detaljrikdommen i et bilde ved å gjøre det skarpere. Effekten gjør endringer i lystettheten til bildet. Krominansen til bildepunktene påvirkes ikke.";"CISixfoldReflectedTile" = "Lager et brikkemønster av et kildebilde ved å bruke 6-veis reflektert symmetri.";"CISixfoldRotatedTile" = "Lager et brikkemønster av et kildebilde ved å rotere kildebildet i trinn på 60 grader.";"CISourceAtopCompositing" = "Plasserer kildebildet over bakgrunnsbildet, og bruker deretter lystettheten til bakgrunnsbildet for å bestemme hva som vises. Komposittbildet viser bakgrunnsbildet og kun de delene av kildebildet som ligger over synlige deler av bakgrunnen.";"CISourceInCompositing" = "Bruker bilde nummer to for å bestemme hva som skal beholdes i kildebildet. Bildet blir i realiteten beskåret.";"CISourceOutCompositing" = "Bruker bilde nummer to for å bestemme hva som skal tas ut av kildebildet.";"CISourceOverCompositing" = "Plasserer bilde nummer to over bilde nummer én.";"CISpotColor" = "Erstatter ett eller flere fargeområder med spotfarger.";"CISpotLight" = "Legger til en retningsbestemt lyskastereffekt på et bilde.";"CIStarShineGenerator" = "Genererer et mønster med en funklende stjerne. Det resulterende bildet brukes vanligvis som inndata i et annet filter.";"CIStripesGenerator" = "Oppretter et stripemønster. Du kan styre fargen på stripene, avstanden og kontrasten.";"CISunbeamsGenerator" = "Lager en soleffekt. Du bruker vanligvis utdata fra solstrålefilteret som inndata i et komposittfilter.";"CISwipeTransition" = "Lager en overgang fra et bilde til et annet ved å simulere en dragende bevegelse.";"CITorusLensDistortion" = "Oppretter en torusformet linse og forvrenger delen av bildet linsen plasseres over.";"CITriangleTile" = "Tilordner en trekantet del av bildet til et trekantet område og deler deretter resultatet inn i brikker.";"CITwelvefoldReflectedTile" = "Lager et brikkemønster av et kildebilde ved å bruke 12-veis reflektert symmetri.";"CITwirlDistortion" = "Roterer bildepunkter rundt et punkt for å lage en virveleffekt. Du kan angi antallet rotasjoner i tillegg til sentrum for og radiusen til effekten.";"CIUnsharpMask" = "Øker kontrasten til kantene mellom bildepunkter med forskjellig farge i et bilde.";"CIVortexDistortion" = "Roterer bildepunkter rundt et punkt for å simulere en vorteks. Du kan angi antallet rotasjoner i tillegg til sentrum for og radiusen til effekten. ";"CIWhitePointAdjust" = "Justerer referansehvitpunktet for et bilde og tilordner alle fargene i kilden ved hjelp av den nye referansen.";"CIZoomBlur" = "Simulerer effekten av å zoome med kameraet mens bildet tas.";"CIColorBlendMode" = "Bruker lystetthetsverdiene til bakgrunnen og nyanse- og metningsverdiene til kildebildet. Denne modusen bevarer grånivåene i bildet.";"CIColorBurnBlendMode" = "Gjør bakgrunnsbildesamplingene mørkere for å gjenspeile kildebildesamplingene. Kildebildesamplingsverdier som angir hvitt, gir ikke forandring.";"CIColorDodgeBlendMode" = "Gjør bakgrunnsbildesamplingene lysere for å gjenspeile kildebildesamplingene. Kildebildesamplingsverdier som angir svart, gir ikke forandring.";"CIDarkenBlendMode" = "Oppretter komposittbildesamplinger ved å velge mørkere samplinger (enten fra kildebildet eller bakgrunnen). Resultatet er at bakgrunnsbildesamplinger erstattes hvis det finnes kildebildesamplinger som er mørkere. Hvis dette ikke er tilfelle, endres ikke bakgrunnsbildesamplingene.";"CIDifferenceBlendMode" = "Trekker enten samplingsfargen i kildebildet fra samplingsfargen i bakgrunnsbildet eller omvendt, avhengig av hvilken sampling som har høyest lysstyrkeverdi. Kildebildesamplingsverdier som er svarte, gir ikke forandring, mens hvitt inverterer bakgrunnsfargeverdiene.";"CIExclusionBlendMode" = "Gir en effekt som ligner på effekten av CIDifferenceBlendMode-filteret, men med mindre kontrast. Kildebildesamplingsverdier som er svarte, gir ikke forandring, mens hvitt inverterer bakgrunnsfargeverdiene.";"CIHardLightBlendMode" = "Multipliserer eller rastrerer farger, avhengig av samplingsfargen i kildebildet. Hvis samplingsfargen i kildebildet er lysere enn 50 % grå, blir bakgrunnen gjort lysere, på samme måte som ved rastrering. Hvis samplingsfargen i kildebildet er mørkere enn 50 % grå, blir bakgrunnen gjort mørkere, på samme måte som ved multiplisering. Hvis samplingsfargen i kildebildet er lik 50 % grå, endres ikke kildebildet. Bildesamplinger som er helt svarte eller helt hvite, gir svart og hvitt. Den samlede effekten ligner på effekten av å rette et skarpt lys mot kildebildet.";"CIHueBlendMode" = "Bruker bakgrunnens verdier for lystetthet og metning sammen med nyansen til kildebildet.";"CILightenBlendMode" = "Oppretter komposittbildesamplinger ved å velge lysere samplinger (enten fra kildebildet eller bakgrunnen). Resultatet er at bakgrunnsbildesamplinger erstattes hvis det finnes kildebildesamplinger som er lysere. Hvis dette ikke er tilfelle, endres ikke bakgrunnsbildesamplingene.";"CILuminosityBlendMode" = "Bruker nyansen og metningen til bakgrunnen og lystettheten til kildebildet. Denne modusen gir en effekt som er den motsatte av effekten til CIColorBlendMode-filteret.";"CIMultiplyBlendMode" = "Multipliserer kildebildesamplinger med bakgrunnsbildesamplinger. Resultatet er farger som er minst like mørke som den mørkeste av de to samplingsfargene.";"CIOverlayBlendMode" = "Multipliserer eller rastrerer kildebildesamplinger med bakgrunnsbildesamplinger, avhengig av bakgrunnsfargen. Resultatet er at eksisterende bildesamplinger legges over hverandre, samtidig som lyse områder og skygger i bakgrunnen bevares. Bakgrunnsfargen blandes med kildebildet for å gjenspeile lyse og mørke områder i bakgrunnen.";"CISaturationBlendMode" = "Bruker lystetthets- og nyanseverdiene til bakgrunnen og metningen til kildebildet. Bakgrunnsområder uten metning (det vil si områder som er helt grå) gir ikke forandring.";"CIScreenBlendMode" = "Multipliserer inverse kildebildesamplinger med inverse bakgrunnsbildesamplinger. Resultatet er farger som er minst like lyse som den lyseste av de to samplingsfargene.";"CISoftLightBlendMode" = "Gjør farger lysere eller mørkere, avhengig av samplingsfargen i kildebildet. Hvis samplingsfargen i kildebildet er lysere enn 50 % grå, blir bakgrunnen gjort lysere, en effekt som ligner på overeksponering. Hvis samplingsfargen i kildebildet er mørkere enn 50 % grå, blir bakgrunnen gjort mørkere, en effekt som ligner på overeksponering. Hvis samplingsfargen i kildebildet er lik 50 % grå, endres ikke bakgrunnen. Bildesamplinger som er helt svarte eller helt hvite, gir mørkere og lysere områder, men gir ikke helt svart og helt hvitt. Den samlede effekten ligner på effekten av å rette et dempet lys mot kildebildet.";"outputImage" = "Bildet et filter produserer.";"inputBackgroundImage" = "Bildet som skal brukes som bakgrunnsbilde.";"inputImage" = "Bildet som skal brukes som inndata. Hvis filteret også bruker et bakgrunnsbilde, er dette forgrunnsbildet.";"inputTime" = "Varigheten til effekten.";"inputTransform" = "En transformasjon som skal brukes.";"inputScale" = "Omfanget til effekten.";"inputAspectRatio" = "Et størrelsesforhold";"inputCenter" = "Sentrum, som x- og y-koordinater, for området som skal filtreres.";"inputRadius" = "Avstanden fra sentrum for effekten.";"inputAngle" = "En vinkel.";"inputRefraction" = "Brytningsindeksen for materialet (for eksempel glass) som brukes i effekten.";"inputWidth" = "Bredden på effekten.";"inputSharpness" = "Hvor mye skarpheten skal økes.";"inputIntensity" = "Intensiteten til effekten.";"inputEV" = "Hvor mye lysere eller mørkere bildet skal gjøres, i f-nummer.";"inputSaturation" = "Hvor mye metningen skal justeres.";"inputColor" = "En farge.";"inputBrightness" = "Et lysstyrkenivå.";"inputContrast" = "Et kontrastnivå.";"inputGradientImage" = "En omgivelsesrefleksjon med alfa. Dette er vanligvis et bilde med lyse områder og skygger.";"inputMaskImage" = "Et maskeringsbilde.";"inputShadingImage" = "En omgivelsesrefleksjon med alfaverdier. Dette er vanligvis et bilde med lyse områder og skygger.";"inputTargetImage" = "Målbildet for en overgang.";"inputExtent" = "En firkant som bestemmer utstrekningen til effekten.";"CIBoxBlur.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage uskarpheten. En større radius gir et mer uskarpt resultat.";"CIDiscBlur.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage uskarpheten. En større radius gir et mer uskarpt resultat.";"CIGaussianBlur.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage uskarpheten. En større radius gir et mer uskarpt resultat.";"CIMotionBlur.inputRadius" ="Radiusen bestemmer hvor mange bildepunkter som brukes for å lage uskarpheten. En større radius gir et mer uskarpt resultat.";"CIMotionBlur.inputAngle" = "Vinkelen til bevegelsen bestemmer i hvilken retning effekten smører ut bildet.";"CINoiseReduction.inputNoiseLevel" = "Mengden støyreduksjon. En høyere verdi gir mer støyreduksjon.";"CINoiseReduction.inputSharpness" = "Skarphet for det ferdige bildet. En høyere verdi gir et skarpere resultat.";"CIZoomBlur.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten";"CIZoomBlur.inputAmount" = "Hvor mye det skal zoomes inn. Høyere verdier gir mer zooming.";"CIColorControls.inputSaturation" = "Hvor mye metning som skal brukes. En høyere verdi gir et resultat med mer metning.";"CIColorControls.inputBrightness" = "Hvor mye lysstyrke som skal brukes. En høyere verdi gir et mer lyssterkt resultat.";"CIColorControls.inputContrast" = "Hvor mye kontrast som skal brukes. En høyere verdi gir mer kontrast i det resulterende bildet.";"CIColorMatrix.inputRVector" = "Mengden rødt kildefargeverdiene skal multipliseres med.";"CIColorMatrix.inputGVector" = "Mengden grønt kildefargeverdiene skal multipliseres med.";"CIColorMatrix.inputBVector" = "Mengden blått kildefargeverdiene skal multipliseres med.";"CIColorMatrix.inputAVector" = "Mengden alfa kildefargeverdiene skal multipliseres med.";"CIColorMatrix.inputBiasVector" = "En vektor som legges til i hver fargekomponent.";"CIExposureAdjust.inputEV" = "Hvor mye eksponeringen i bildet skal justeres med. En høyere verdi gir lysere eksponering.";"CIGammaAdjust.inputPower" = "En gammaverdi som skal brukes for å korrigere lysstyrken i et bilde. En høyere verdi gir et mørkere resultat.";"CIHueAdjust.inputAngle" = "En vinkel (i grader) som brukes for å korrigere nyansen i et bilde.";"CIWhitePointAdjust.inputColor" = "En farge som brukes som hvitpunkt.";"CIColorCube.inputDimension" = "Størrelsen på fargetabellen.";"CIColorCube.inputCubeData" = "Dette er en fargetabell med flyttalls-RGBA-ruter som bruker forhåndsmultiplisert alfa. Rutene er organisert i en standardrekkefølge. Kolonnene og radene til dataene er indeksert med henholdsvis rødt og grønt. Hvert dataplan etterfølges av neste, høyere plan i dataene. Planene er indeksert med blått.";"CIColorMap.inputGradientImage" = "Bildedataene fra dette bildet transformerer kildebildeverdiene.";"CIColorMonochrome.inputColor" = "Monokromfargen som skal legges til på bildet.";"CIColorMonochrome.inputIntensity" = "Intensiteten til monokromeffekten. En verdi på 1,0 oppretter et monokrombilde ved hjelp av fargen som er oppgitt. En verdi på 0,0 gir ingen effekt på bildet.";"CIColorPosterize.inputLevels" = "Antallet lysstyrkenivåer som skal brukes for hver fargekomponent. En lavere verdi gir en kraftigere plakateffekt.";"CIFalseColor.inputColor0" = "Den første fargen som skal brukes i fargespekteret.";"CIFalseColor.inputColor1" = "Den andre fargen som skal brukes i fargespekteret.";"CISepiaTone.inputIntensity" = "Intensiteten til sepiaeffekten. En verdi på 1,0 oppretter et monokromt sepiabilde. En verdi på 0,0 gir ingen effekt på bildet.";"CIBumpDistortion.inputCenter" = "X- og y-plasseringen som brukes som sentrum for krummingen."; "CIBumpDistortion.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage forvrengningen. En større radius gir større forvrengning."; "CIBumpDistortion.inputScale" = "Størrelsen på effekten bestemmer krummingen. En verdi på 0,0 gir ingen effekt. Positive verdier gir krumming utover. Negative verdier gir krumming innover."; "CIBumpDistortionLinear.inputCenter" = "X- og y-plasseringen som brukes som sentrum for forvrengningen."; "CIBumpDistortionLinear.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage forvrengningen. En større radius gir større forvrengning.";  "CIBumpDistortionLinear.inputScale" = "Størrelsen på effekten."; "CIBumpDistortionLinear.inputAngle" = "Vinkelen (i grader) til linjen forvrengningen oppstår rundt."; "CICircleSplashDistortion.inputCenter" = "X- og y-plasseringen som brukes som sentrum for forvrengningen.";  "CICircleSplashDistortion.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage forvrengningen. En større radius gir større forvrengning.";  "CICircularWrap.inputCenter" = "X- og y-plasseringen som brukes som sentrum for forvrengningen.";  "CICircularWrap.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage forvrengningen. En større radius gir større forvrengning.";  "CICircularWrap.inputAngle" = "Vinkelen for effekten."; "CIDisplacementDistortion.inputDisplacementImage" = "Et bilde som inneholder gråskalaverdier som skal brukes på kildebildet."; "CIDisplacementDistortion.inputScale" = "Hvor mye tekstur som skal brukes i det resulterende bildet. En høyere verdi gir mer tekstur."; "CIGlassDistortion.inputTexture" = "En tekstur som skal legges til på kildebildet.";"CIGlassDistortion.inputCenter" = "X- og y-plasseringen som brukes som sentrum for forvrengningen."; "CIGlassDistortion.inputScale" = "Hvor mye tekstur som skal brukes i det resulterende bildet. En høyere verdi gir mer tekstur."; "CIGlassLozenge.inputPoint0" = "X- og y-plasseringen som definerer sentrum av sirkelen i den ene enden av pastillen."; "CIGlassLozenge.inputPoint1" = "X- og y-plasseringen som definerer sentrum av sirkelen i den andre enden av pastillen.";  "CIGlassLozenge.inputRadius" = "Radiusen til pastillen. En større radius gir forvrengning på et større område.";  "CIGlassLozenge.inputRefraction" = "Refraksjonen for glasset."; "CIHoleDistortion.inputCenter" = "X- og y-plasseringen som brukes som sentrum for forvrengningen.";  "CIHoleDistortion.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage forvrengningen. En større radius gir større forvrengning.";  "CIPinchDistortion.inputCenter" = "X- og y-plasseringen som brukes som sentrum for forvrengningen."; "CIPinchDistortion.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage forvrengningen. En større radius gir større forvrengning."; "CIPinchDistortion.inputScale" = "Hvor mye bildet knipes. En verdi på 0,0 gir ingen effekt. En verdi på 1,0 gir maksimal kniping.";"CITorusLensDistortion.inputCenter" = "X- og y-plasseringen som brukes som sentrum for torusen.";  "CITorusLensDistortion.inputRadius" = "Den ytre radiusen til torusen.";  "CITorusLensDistortion.inputWidth" = "Bredden på ringen."; "CITorusLensDistortion.inputRefraction" = "Refraksjonen for glasset."; "CITwirlDistortion.inputCenter" = "X- og y-plasseringen som brukes som sentrum for forvrengningen.";  "CITwirlDistortion.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage forvrengningen. En større radius gir større forvrengning."; "CITwirlDistortion.inputAngle" = "Vinkelen (i grader) til virvelen. Verdien kan være positiv eller negativ.";"CIVortexDistortion.inputCenter" = "X- og y-plasseringen som brukes som sentrum for forvrengningen."; "CIVortexDistortion.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage forvrengningen. En større radius gir større forvrengning."; "CIVortexDistortion.inputAngle" = "Vinkelen (i grader) på vorteksen.";"CICheckerboardGenerator.inputColor0" = "En farge som brukes på det første settet med firkanter på sjakkbrettmønsteret.";"CICheckerboardGenerator.inputColor1" = "En farge som brukes på det andre settet med firkanter på sjakkbrettmønsteret.";"CICheckerboardGenerator.inputWidth" = "Bredden på en firkant i sjakkbrettmønsteret.";"CICheckerboardGenerator.inputSharpness" = "Skarpheten til sjakkbrettmønsteret. En lavere verdi gir et mer uskarpt mønster. Verdien er mellom 0,0 og 1,0.";"CIConstantColorGenerator.inputColor" = "Fargen som skal genereres."; "CILenticularHaloGenerator.inputCenter" = "X- og y-plasseringen som brukes som sentrum for haloen.";"CILenticularHaloGenerator.inputHaloRadius" = "Radiusen til haloen.";"CILenticularHaloGenerator.inputHaloWidth" = "Bredden til haloen fra radiusen på innsiden til radiusen på utsiden.";"CILenticularHaloGenerator.inputOverlap" = "Hvor mye diffraksjonskomponentene i haloen skal overlappe. En verdi på 1,0 gir fullstendig overlapping og en hvit halo. En verdi på 0,0 gir ingen overlapping – fargene i haloen overlapper ikke hverandre.";"CILenticularHaloGenerator.inputStriationStrength" = "Intensiteten til fargene i haloen. Høyere verdier gir mer intensitet.";"CILenticularHaloGenerator.inputStriationContrast" = "Kontrasten til fargene i haloen. Høyere verdier gir mer kontrast.";"CIStarShineGenerator.inputCenter" = "X- og y-plasseringen som brukes som sentrum for stjernen."; "CIStarShineGenerator.inputColor" = "Fargen som brukes på den ytre delen av den runde stjernen."; "CIStarShineGenerator.inputRadius" = "Radiusen til stjernen."; "CIStarShineGenerator.inputCrossScale" = "Størrelsen på kryssmønsteret."; "CIStarShineGenerator.inputCrossAngle" = "Vinkelen for kryssmønsteret."; "CIStarShineGenerator.inputCrossOpacity" = "Gjennomskinneligheten til kryssmønsteret."; "CIStarShineGenerator.inputCrossWidth" = "Bredden på kryssmønsteret."; "CIStarShineGenerator.inputEpsilon" = "Lengden på krysstaggene."; "CIStripesGenerator.inputCenter" = "X- og y-plasseringen som brukes som sentrum for stripemønsteret."; "CIStripesGenerator.inputColor0" = "En farge som brukes for oddetallsstripene."; "CIStripesGenerator.inputColor1" = "En farge som brukes for partallsstripene.";"CIStripesGenerator.inputWidth" = "Bredden på en stripe."; "CIStripesGenerator.inputSharpness" = "Skarpheten til stripemønsteret. En lavere verdi gir et mer uskarpt mønster. Verdien er mellom 0,0 og 1,0."; "CISunbeamsGenerator.inputCenter" = "X- og y-plasseringen som brukes som sentrum for solstrålemønsteret";"CISunbeamsGenerator.inputColor" = "Fargen til solen.";"CISunbeamsGenerator.inputSunRadius" = "Radiusen til solen.";"CISunbeamsGenerator.inputMaxStriationRadius" = "Radiusen til solstrålene.";"CISunbeamsGenerator.inputStriationStrength" = "Intensiteten til solstrålene. Høyere verdier gir mer intensitet.";"CISunbeamsGenerator.inputStriationContrast" = "Kontrasten til solstrålene. Høyere verdier gir mer kontrast.";"CIAffineTransform.inputTransform" = "En transformasjon som skal legges til på bildet."; "CICrop.inputRectangle" = "Firkanten som angir beskjæringen som skal utføres på bildet."; "CILanczosScaleTransform.inputScale" = "Skaleringsfaktoren som skal brukes på bildet. Verdier som er lavere enn 1,0, skalerer bildet ned. Verdier som er høyere enn 1,0, skalerer bildet opp."; "CILanczosScaleTransform.inputAspectRatio" = "Størrelsesforhold for bildet."; "CIPerspectiveTransform.inputTopLeft" = "Den øverste, venstre koordinaten bildet skal tilordnes til."; "CIPerspectiveTransform.inputTopRight" = "Den øverste, høyre koordinaten bildet skal tilordnes til."; "CIPerspectiveTransform.inputBottomRight" = "Den nederste, høyre koordinaten bildet skal tilordnes til."; "CIPerspectiveTransform.inputBottomLeft" = "Den nederste, venstre koordinaten bildet skal tilordnes til."; "CIGaussianGradient.inputColor0" = "Den første fargen som skal brukes i forløpningen."; "CIGaussianGradient.inputColor1" = "Den andre fargen som skal brukes i forløpningen."; "CIGaussianGradient.inputRadius" = "Radiusen til den gaussiske fordelingen."; "CILinearGradient.inputPoint0" = "Startposisjonen til forløpningen – stedet der den første fargen begynner."; "CILinearGradient.inputPoint1" = "Sluttposisjonen til forløpningen – stedet der den andre fargen begynner."; "CILinearGradient.inputColor0" = "Den første fargen som skal brukes i forløpningen.";  "CILinearGradient.inputColor1" = "Den andre fargen som skal brukes i forløpningen.";  "CIRadialGradient.inputRadius0" = "Radiusen til startsirkelen som skal brukes i forløpningen.";"CIRadialGradient.inputRadius1" = "Radiusen til sluttsirkelen som skal brukes i forløpningen.";"CIRadialGradient.inputColor0" = "Den første fargen som skal brukes i forløpningen.";  "CIRadialGradient.inputColor1" = "Den andre fargen som skal brukes i forløpningen."; "CICircularScreen.inputCenter" = "X- og y-plasseringen som brukes som sentrum for sirkelrastermønsteret"; "CICircularScreen.inputWidth" = "Avstanden mellom hver sirkel i mønsteret."; "CICircularScreen.inputSharpness" = "Skarphet for sirklene. En høyere verdi gir skarpere sirkler."; "CICMYKHalftone.inputCenter" = "X- og y-plasseringen som brukes som sentrum for halvtonemønsteret";  "CICMYKHalftone.inputWidth" = "Avstanden mellom punkter i mønsteret."; "CICMYKHalftone.inputAngle" = "Vinkelen for mønsteret."; "CICMYKHalftone.inputSharpness" = "Skarphet for mønsteret. En høyere verdi gir et skarpere mønster."; "CICMYKHalftone.inputGCR" = "Erstatningsverdi for gråkomponent. Verdien kan være mellom 0,0 (ingen) og 1,0."; "CICMYKHalftone.inputUCR" = "Fjerningsverdi for underfarge. Verdien kan være mellom 0,0 og 1,0. "; "CIDotScreen.inputCenter" = "X- og y-plasseringen som brukes som sentrum for punktrastermønsteret";  "CIDotScreen.inputAngle" = "Vinkelen for mønsteret."; "CIDotScreen.inputWidth" = "Avstanden mellom punkter i mønsteret."; "CIDotScreen.inputSharpness" = "Skarphet for mønsteret. En høyere verdi gir et skarpere mønster."; "CIHatchedScreen.inputCenter" = "X- og y-plasseringen som brukes som sentrum for det skraverte rastermønsteret"; "CIHatchedScreen.inputAngle" = "Vinkelen for mønsteret.";"CIHatchedScreen.inputWidth" = "Avstanden mellom linjene i mønsteret."; "CIHatchedScreen.inputShaprness" = "Skarphet for mønsteret. En høyere verdi gir et skarpere mønster."; "CILineScreen.inputCenter" = "X- og y-plasseringen som brukes som sentrum for linjerastermønsteret";  "CILineScreen.inputAngle" = "Vinkelen for mønsteret."; "CILineScreen.inputWidth" = "Avstanden mellom linjene i mønsteret."; "CILineScreen.inputSharpness" = "Skarphet for mønsteret. En høyere verdi gir et skarpere mønster."; 	"CISharpenLuminance.inputSharpness" = "Hvor mye skarpheten skal økes. Høyere verdier gir mer skarphet.";"CIUnsharpMask.inputRadius" = "Radiusen rundt et bestemt bildepunkt der uskarphetsmasken skal brukes. En større radius betyr at større deler av bildet påvirkes.";"CIUnsharpMask.inputIntensity" = "Intensiteten til effekten. En høyere verdi gir mer kontrast i området som påvirkes.";"CIBlendWithMask.inputMaskImage" = "En gråskalamaske. Når en maskeverdi er 0,0, er resultatet bakgrunnen. Når maskeverdien er 1,0, er resultatet bildet."; "CIBloom.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage effekten. En større radius gir en større effekt.";"CIBloom.inputIntensity" = "Intensiteten til effekten. En verdi på 0,0 er ingen effekt. En verdi på 1,0 er maksimal effekt."; "CICrystallize.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage effekten. En større radius gir større krystaller."; "CIEdges.inputIntensity" = "Intensiteten til kantene. En høyere verdi gir høyere intensitet."; "CIEdgeWork.inputRadius" = "Tykkelsen til kantene. En høyere verdi gir tykkere kanter."; "CIGloom.inputRadius" = "Radiusen bestemmer hvor mange bildepunkter som brukes for å lage effekten. En større radius gir en større effekt."; "CIGloom.inputIntensity" = "Intensiteten til effekten. En verdi på 0,0 er ingen effekt. En verdi på 1,0 er maksimal effekt."; "CIHeightFieldFromMask.inputImage" = "De hvite verdiene til masken definerer hvilke bildepunkter som er innenfor høydefeltet, mens de svarte verdiene definerer hvilke bildepunkter som er utenfor. Feltet varierer jevnt og kontinuerlig i masken og når verdien 0 ved kanten av masken."; "CIHeightFieldFromMask.inputRadius" = "Avstanden fra kanten av masken for den jevne overgangen er proporsjonal med inndataradiusen. Høyere verdier gjør overgangen jevnere og mer markant. Lavere verdier gjør at overgangen beregner en radius for avrunding av kanter."; "CIHexagonalPixellate.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten"; "CIHexagonalPixellate.inputScale" = "Verdien bestemmer størrelsen på sekskantene. Høyere verdier gir større sekskanter."; "CILineOverlay.inputNRNoiseLevel" = "Støynivået i bildet (brukt sammen med kamerainformasjon) som fjernes før kantene i bildet spores. Hvis du øker støynivået, bidrar det til å rense opp kantene som spores i bildet."; "CILineOverlay.inputNRSharpness" = "Hvor mye skarpheten i bildet økes når du fjerner støy før du sporer kantene i bildet. Dette gir bedre henting av kanter."; "CILineOverlay.inputEdgeIntensity" = "Aksentueringsfaktoren for Sobel-forløpningsinformasjonen under sporing av kanter i et bilde. Høyere verdier fører til at flere kanter blir funnet, men vanligvis brukes en lavere verdi (for eksempel 1,0)."; "CILineOverlay.inputThreshold" = "Denne verdien bestemmer synligheten til kantene. Høyere verdier gjør kantene smalere."; "CILineOverlay.inputContrast" = "Hvor mye kantutjevning som skal brukes på kantene dette filteret lager. Høyere verdier gir kanter med mer kontrast (mindre kantutjevning)."; "CIPixellate.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten";  "CIPixellate.inputScale" = "Verdien bestemmer størrelsen på firkantene. Høyere verdier gir større firkanter."; "CIPointillize.inputRadius" = "Radiusen til sirklene i det resulterende mønsteret."; "CIPointillize.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten";  "CIShadedMaterial.inputShadingImage" = "Bildet som skal brukes som høydefelt. I det resulterende bildet har høyere områder med lyse toner og lavere områder med mørke toner."; "CIShadedMaterial.inputScale" = "Størrelsen på effekten. En høyere verdi gir en mer dramatisk effekt."; "CISpotColor.inputCenterColor1" = "Senterverdien for det første fargeområdet som skal erstattes."; "CISpotColor.inputReplacementColor1" = "En erstatningsfarge for det første fargeområdet."; "CISpotColor.inputCloseness1" = "En verdi som angir hvor nærme den første fargen må ligge før den erstattes."; "CISpotColor.inputContrast1" = "Kontrasten til den første erstatningsfargen."; "CISpotColor.inputCenterColor2" = "Senterverdien for det andre fargeområdet som skal erstattes."; "CISpotColor.inputReplacementColor2" = "En erstatningsfarge for det andre fargeområdet.";"CISpotColor.inputCloseness2" = "En verdi som angir hvor nærme den andre fargen må ligge før den erstattes."; "CISpotColor.inputContrast2" = "Kontrasten til den andre erstatningsfargen."; "CISpotColor.inputCenterColor3" = "Senterverdien for det tredje fargeområdet som skal erstattes.";  "CISpotColor.inputReplacementColor3" = "En erstatningsfarge for det tredje fargeområdet."; "CISpotColor.inputCloseness3" = "En verdi som angir hvor nærme den tredje fargen må ligge før den erstattes.";  "CISpotColor.inputContrast3" = "Kontrasten til den tredje erstatningsfargen.";  "CISpotLight.inputLightPosition" = "X- og y-plasseringen til lyskasteren."; 		"CISpotLight.inputLightPointsAt" = "X- og y-plasseringen lyskasteren rettes mot.";  "CISpotLight.inputBrightness" = "Lysstyrken til lyskasteren."; "CISpotLight.inputConcentration" = "Størrelsen på lyskasteren. En lavere verdi gir en mer fokusert lysstråle."; "CISpotLight.inputColor" = "Fargen til lyskasteren."; "CIAffineClamp.inputTransform" = "Transformasjonen som skal legges til på bildet."; "CIAffineTile.inputTransform" = "Transformasjonen som skal legges til på bildet."; "CIEightfoldReflectedTile.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten";  "CIEightfoldReflectedTile.inputAngle" = "Vinkelen (i grader) på brikkemønsteret."; "CIEightfoldReflectedTile.inputWidth" = "Bredden på en brikke."; "CIFourfoldReflectedTile.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten";  "CIFourfoldReflectedTile.inputAngle" = "Vinkelen (i grader) på brikkemønsteret.";  "CIFourfoldReflectedTile.inputAcuteAngle" = "Primærvinkelen for brikken som skal reflekteres flere ganger. Lavere verdier gir tynne, diamantformede brikker, og høyere verdier gir større reflekterte brikker."; "CIFourfoldReflectedTile.inputWidth" = "Bredden på en brikke.";  "CIFourfoldRotatedTile.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten";  "CIFourfoldRotatedTile.inputAngle" = "Vinkelen (i grader) på brikkemønsteret.";  "CIFourfoldRotatedTile.inputWidth" = "Bredden på en brikke."; "CIFourfoldTranslatedTile.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten";  "CIFourfoldTranslatedTile.inputAngle" = "Vinkelen (i grader) på brikkemønsteret.";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "Primærvinkelen for brikken som skal forskyves flere ganger. Lavere verdier gir tynne, diamantformede brikker, og høyere verdier gir større brikker."; "CIFourfoldTranslatedTile.inputWidth" = "Bredden på en brikke.";  "CIGlideReflectedTile.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten";  "CIGlideReflectedTile.inputAngle" = "Vinkelen (i grader) på brikkemønsteret.";  "CIGlideReflectedTile.inputWidth" = "Bredden på en brikke.";  "CIKaleidoscope.inputCount" = "Antallet refleksjoner i mønsteret."; "CIKaleidoscope.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten";  "CIKaleidoscope.inputAngle" = "Vinkelen for refleksjonen."; "CIOpTile.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten";  "CIOpTile.inputScale" = "Størrelsen bestemmer antallet brikker i effekten."; "CIOpTile.inputAngle" = "Vinkelen for en brikke."; "CIOpTile.inputWidth" = "Bredden på en brikke."; "CIParallelogramTile.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten"; "CIParallelogramTile.inputAngle" = "Vinkelen (i grader) på brikkemønsteret.";  "CIParallelogramTile.inputAcuteAngle" = "Primærvinkelen for den repeterende parallellogrambrikken. Lavere verdier gir tynne, diamantformede brikker, og høyere verdier gir større parallellogrambrikker."; "CIParallelogramTile.inputWidth" = "Bredden på en brikke.";  "CIPerspectiveTile.inputTopLeft" = "Koordinaten for det øverste, venstre hjørnet av en brikke."; "CIPerspectiveTile.inputTopRight" = "Koordinaten for det øverste, høyre hjørnet av en brikke.";"CIPerspectiveTile.inputBottomRight" = "Koordinaten for det nederste, høyre hjørnet av en brikke."; "CIPerspectiveTile.inputBottomLeft" = "Koordinaten for det nederste, venstre hjørnet av en brikke."; "CISixfoldReflectedTile.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten";  "CISixfoldReflectedTile.inputAngle" = "Vinkelen (i grader) på brikkemønsteret.";  "CISixfoldReflectedTile.inputWidth" = "Bredden på en brikke."; "CISixfoldRotatedTile.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten"; "CISixfoldRotatedTile.inputAngle" = "Vinkelen (i grader) på brikkemønsteret.";  "CISixfoldRotatedTile.inputWidth" = "Bredden på en brikke.";  "CITriangleTile.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten";  "CITriangleTile.inputAngle" = "Vinkelen (i grader) på brikkemønsteret.";  "CITriangleTile.inputWidth" = "Bredden på en brikke.";  "CITwelvefoldReflectedTile.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten"; "CITwelvefoldReflectedTile.inputAngle" = "Vinkelen (i grader) på brikkemønsteret.";"CITwelvefoldReflectedTile.inputWidth" = "Bredden på en brikke."; "CIBarsSwipeTransition.inputAngle" = "Vinkelen (i grader) på søylene.";	"CIBarsSwipeTransition.inputWidth" = "Bredden for hver søyle.";	"CIBarsSwipeTransition.inputBarOffset" = "Plasseringen av en søyle i forhold til en annen";	"CIBarsSwipeTransition.inputTime" = "Parametrisk tid for overgangen. Denne verdien driver overgangen fra start (tidspunkt 0) til slutt (tidspunkt 1).";"CICopyMachineTransition.inputColor" = "Fargen på kopieringsmaskinlyset.";"CICopyMachineTransition.inputAngle" = "Vinkelen for kopieringsmaskinlyset.";"CICopyMachineTransition.inputWidth" = "Bredden på kopieringsmaskinlyset. ";"CICopyMachineTransition.inputOpacity" = "Gjennomskinneligheten til kopieringsmaskinlyset. En verdi på 0,0 er gjennomsiktig. En verdi på 1,0 er ugjennomsiktig.";"CICopyMachineTransition.inputTime" = "Parametrisk tid for overgangen. Denne verdien driver overgangen fra start (tidspunkt 0) til slutt (tidspunkt 1).";"CIDisintegrateWithMaskTransition.inputMaskImage" = "Et bilde som definerer formen som skal brukes for desintegrering fra kilden til målbildet.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "Radiusen til skyggen som opprettes av masken.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "Tettheten på skyggen som opprettes av masken.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "Plasseringen av skyggen som opprettes av masken.";"CIDisintegrateWithMaskTransition.inputTime" = "Parametrisk tid for overgangen. Denne verdien driver overgangen fra start (tidspunkt 0) til slutt (tidspunkt 1).";"CIDissolveTransition.inputTime" = "Parametrisk tid for overgangen. Denne verdien driver overgangen fra start (tidspunkt 0) til slutt (tidspunkt 1).";"CIFlashTransition.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten"; "CIFlashTransition.inputExtent" = "Utstrekningen til lysglimtet.";"CIFlashTransition.inputColor" = "Fargen på lysstrålene som kommer fra lysglimtet.";"CIFlashTransition.inputMaxStriationRadius" = "Radiusen til lysstrålene som kommer fra lysglimtet.";"CIFlashTransition.inputStriationStrength" = "Styrken på lysstrålene som kommer fra lysglimtet.";"CIFlashTransition.inputStriationContrast" = "Kontrasten til lysstrålene som kommer fra lysglimtet.";"CIFlashTransition.inputFadeThreshold" = "Mengden toning mellom lysglimtet og målbildet. En høyere verdi gir lengre varighet for lysglimtet og kortere varighet for toningen.";"CIFlashTransition.inputTime" = "Parametrisk tid for overgangen. Denne verdien driver overgangen fra start (tidspunkt 0) til slutt (tidspunkt 1).";"CIModTransition.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten"; "CIModTransition.inputAngle" = "Vinkelen for mod-hullmønsteret.";"CIModTransition.inputRadius" = "Radiusen til hull uten forvrengning i mønsteret.";"CIModTransition.inputCompression" = "Hvor mye strekking som brukes på mod-hullmønsteret. Hull i midten forvrenges ikke like mye som hull ytterst i bildet.";"CIModTransition.inputTime" = "Parametrisk tid for overgangen. Denne verdien driver overgangen fra start (tidspunkt 0) til slutt (tidspunkt 1).";"CIPageCurlTransition.inputBacksideImage" = "Bildet som vises på baksiden av kildebildet, mens siden blas om for å vise målbildet.";"CIPageCurlTransition.inputShadingImage" = "Et bilde som ser ut som en skyggelagt kule omsluttet av et firkantet bilde.";"CIPageCurlTransition.inputExtent" = "Utstrekningen til effekten.";"CIPageCurlTransition.inputAngle" = "Vinkelen for siden som blas.";"CIPageCurlTransition.inputRadius" = "Radiusen til bretten.";"CIPageCurlTransition.inputTime" = "Parametrisk tid for overgangen. Denne verdien driver overgangen fra start (tidspunkt 0) til slutt (tidspunkt 1).";"CIRippleTransition.inputShadingImage" = "Et bilde som ser ut som en skyggelagt kule omsluttet av et firkantet bilde.";"CIRippleTransition.inputCenter" = "X- og y-plasseringen som brukes som sentrum for effekten"; "CIRippleTransition.inputExent" = "Utstrekningen til effekten.";"CIRippleTransition.inputWidth" = "Bredden på krusningen.";"CIRippleTransition.inputScale" = "En verdi som bestemmer om krusningen begynner som en forhøyning (høyere verdier) eller en fordypning (lavere verdier).";"CIRippleTransition.inputTime" = "Parametrisk tid for overgangen. Denne verdien driver overgangen fra start (tidspunkt 0) til slutt (tidspunkt 1).";"CISwipeTransition.inputExtent" = "Utstrekningen til effekten.";"CISwipeTransition.inputColor" = "Fargen på draget.";"CISwipeTransition.inputAngle" = "Vinkelen for draget.";"CISwipeTransition.inputWidth" = "Bredden på draget.";"CISwipeTransition.inputOpacity" = "Gjennomskinneligheten til draget.";"CISwipeTransition.inputTime" = "Parametrisk tid for overgangen. Denne verdien driver overgangen fra start (tidspunkt 0) til slutt (tidspunkt 1).";"CIAreaHistogram" = "Beregner et histogram for det angitte området i et bilde. Resultatet returneres i et 1D-bilde.";"CIAreaHistogram.inputExtent" = "En firkant som angir underområdet i bildet du vil behandle.";"CIAreaHistogram.inputCount" = "Antallet intervaller i histogrammet.";"CIAreaHistogram.inputImage" = "Bildet du vil beregne et histogram for.";"CIAreaHistogram.inputScale" = "Skalaverdien som skal brukes for histogramverdiene.";"CIAreaMaximum" = "Beregner høyeste komponentverdier for det angitte området i et bilde. Resultatet returneres i et bildepunkt.";"CIAreaMaximum.inputExtent" = "En firkant som angir underområdet i bildet du vil behandle.";"CIAreaMaximum.inputImage" = "Bildet som skal behandles.";"CIAreaMinimum" = "Beregner laveste komponentverdier for det angitte området i et bilde. Resultatet returneres i et bildepunkt.";"CIAreaMinimum.inputExtent" = "En firkant som angir underområdet i bildet du vil behandle.";"CIAreaMinimum.inputImage" = "Bildet som skal behandles.";"CIAreaMaximumAlpha" = "Finner og returnerer bildepunktet med høyest alfaverdi.";"CIAreaMaximumAlpha.inputExtent" = "En firkant som angir underområdet i bildet du vil behandle.";"CIAreaMaximumAlpha.inputImage" = "Bildet som skal behandles.";"CIAreaMinimumAlpha" = "Finner og returnerer bildepunktet med lavest alfaverdi.";"CIAreaMinimumAlpha.inputExtent" = "En firkant som angir underområdet i bildet du vil behandle.";"CIAreaMinimumAlpha.inputImage" = "Bildet som skal behandles.";"CIAreaAverage" = "Beregner gjennomsnittsfargen for det angitte området i et bilde. Resultatet returneres i et bildepunkt.";"CIAreaAverage.inputExtent" = "En firkant som angir underområdet i bildet du vil behandle.";"CIAreaAverage.inputImage" = "Bildet som skal behandles.";"CIRowAverage" = "Beregner gjennomsnittsfargen for hver rad i det angitte området i et bilde. Resultatet returneres i et 1D-bilde.";"CIRowAverage.inputExtent" = "En firkant som angir underområdet i bildet du vil behandle.";"CIRowAverage.inputImage" = "Bildet som skal behandles.";"CIColumnAverage" = "Beregner gjennomsnittsfargen for hver kolonne i det angitte området i et bilde. Resultatet returneres i et 1D-bilde.";"CIColumnAverage.inputExtent" = "En firkant som angir underområdet i bildet du vil behandle.";"CIColumnAverage.inputImage" = "Bildet som skal behandles.";"CIMinimumComponent" = "Konverterer et bilde til gråskala ved hjelp av minimumsverdien til de tre fargekomponentene.";"CIMinimumComponent.inputExtent" = "En firkant som angir underområdet i bildet du vil behandle.";"CIMinimumComponent.inputImage" = "Bildet som skal behandles.";"CIMaximumComponent" = "Konverterer et bilde til gråskala ved hjelp av maksimalverdien til de tre fargekomponentene.";"CIMaximumComponent.inputExtent" = "En firkant som angir underområdet i bildet du vil behandle.";"CIMaximumComponent.inputImage" = "Bildet som skal behandles.";